In [16]:
import pandas as pd
import numpy as np

df = pd.read_csv('data/survey_results_public.csv', index_col='Respondent')
schema_df = pd.read_csv('data/survey_results_schema.csv', index_col='Column')

dict_data = {
    'first': ['kaushal', 'pinkal', 'ananya', np.nan , 'kartavya', 'NA'],
    'last': ['khokhar', 'khokhar', 'patel', np.nan, np.nan, 'Missing'],
    'email':['kaushal.123@gmail.com', 'pinal.123@gmail.com', 'anu.123@gmail.com', None, 'kartu.123@gmail.com', 'Missing'],
    'age': ['33', '45', '5', None, None, 'NA']
}

dict_to_df = pd.DataFrame(dict_data)

In [17]:
dict_to_df

      first     last                  email   age
0   kaushal  khokhar  kaushal.123@gmail.com    33
1    pinkal  khokhar    pinal.123@gmail.com    45
2    ananya    patel      anu.123@gmail.com     5
3       NaN      NaN                   None  None
4  kartavya      NaN    kartu.123@gmail.com  None
5        NA  Missing                Missing    NA

In [18]:
dict_to_df.dropna()

     first     last                  email age
0  kaushal  khokhar  kaushal.123@gmail.com  33
1   pinkal  khokhar    pinal.123@gmail.com  45
2   ananya    patel      anu.123@gmail.com   5
5       NA  Missing                Missing  NA

In [19]:
dict_to_df.dropna(axis='index', how='any')

     first     last                  email age
0  kaushal  khokhar  kaushal.123@gmail.com  33
1   pinkal  khokhar    pinal.123@gmail.com  45
2   ananya    patel      anu.123@gmail.com   5
5       NA  Missing                Missing  NA

In [21]:
# drops only all missing values row
dict_to_df.dropna(axis='index', how='all')

      first     last                  email   age
0   kaushal  khokhar  kaushal.123@gmail.com    33
1    pinkal  khokhar    pinal.123@gmail.com    45
2    ananya    patel      anu.123@gmail.com     5
4  kartavya      NaN    kartu.123@gmail.com  None
5        NA  Missing                Missing    NA

In [22]:
dict_to_df.dropna(axis='columns', how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [24]:
# only drops if Nan in subset
dict_to_df.dropna(axis='index', how='any', subset=['email', 'last'])

     first     last                  email age
0  kaushal  khokhar  kaushal.123@gmail.com  33
1   pinkal  khokhar    pinal.123@gmail.com  45
2   ananya    patel      anu.123@gmail.com   5
5       NA  Missing                Missing  NA

In [26]:
dict_to_df.replace('NA', np.nan, inplace=True)
dict_to_df.replace('Missing', np.nan, inplace=True)
dict_to_df

      first     last                  email   age
0   kaushal  khokhar  kaushal.123@gmail.com    33
1    pinkal  khokhar    pinal.123@gmail.com    45
2    ananya    patel      anu.123@gmail.com     5
3       NaN      NaN                   None  None
4  kartavya      NaN    kartu.123@gmail.com  None
5       NaN      NaN                    NaN   NaN

In [27]:
dict_to_df.dropna(axis='index', how='any', subset=['email', 'last'])

     first     last                  email age
0  kaushal  khokhar  kaushal.123@gmail.com  33
1   pinkal  khokhar    pinal.123@gmail.com  45
2   ananya    patel      anu.123@gmail.com   5

In [29]:
dict_to_df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3   True   True   True   True
4  False   True  False   True
5   True   True   True   True

In [30]:
dict_to_df.fillna('MISSING')

      first     last                  email      age
0   kaushal  khokhar  kaushal.123@gmail.com       33
1    pinkal  khokhar    pinal.123@gmail.com       45
2    ananya    patel      anu.123@gmail.com        5
3   MISSING  MISSING                MISSING  MISSING
4  kartavya  MISSING    kartu.123@gmail.com  MISSING
5   MISSING  MISSING                MISSING  MISSING

In [32]:
dict_to_df['age'].mean()

TypeError: must be str, not int

In [33]:
dict_to_df['age'] = dict_to_df['age'].astype(float)

In [34]:
dict_to_df['age'].mean()

27.666666666666668

In [36]:
# to see unique value in column
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 'Less than 1 year', '30', '9', '26', '40', '19',
       '15', '20', '28', '25', '1', '22', '11', '33', '50', '41', '18',
       '34', '24', '23', '42', '27', '21', '36', '32', '39', '38', '31',
       '37', 'More than 50 years', '29', '44', '45', '48', '46', '43',
       '47', '49'], dtype=object)

In [37]:
df['YearsCode'].replace('Less than 1 year', 0, inplace=True)

In [38]:
df['YearsCode'].replace('More than 50 years', 51, inplace=True)

In [39]:
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 0, '30', '9', '26', '40', '19', '15', '20', '28',
       '25', '1', '22', '11', '33', '50', '41', '18', '34', '24', '23',
       '42', '27', '21', '36', '32', '39', '38', '31', '37', 51, '29',
       '44', '45', '48', '46', '43', '47', '49'], dtype=object)